export const script_tosLine=[
    {
        id: '神魔之塔1',
        steps: [
            { name: "旁白", text: "從那之後建成開始迷上了這款遊戲。" },
            { name: "旁白", text: "他展現對這款遊戲的天賦，仿佛這款遊戲就是為他而生。" },
            { name: "旁白", text: "他通過自己的實力和自己開發的小工具獲得了圈內人的青睞。" },
            { name: "旁白", text: "雖然獲得了肯定，但建成似乎因為官方的神奇操作而感到空虛。" },
            { name: "旁白", text: "晚上他把他的困擾通過與你的私聊傾訴。" },
            { name: "林建成", text: "感覺這個遊戲挺好玩的，但不知道為什麼，總感覺少了些什麼..." }
        ],
        options: [
            {
                text: "或許你可以先放下遊戲試試？去做其他你想做的事情。",
                score: 10,
                next: '8', // 導向原場景 8
                reaction: [
                    { name: "建成", text: "確實呢，感覺要先放下遊戲試試，去追尋我放不下的人。" },
                    { name: "旁白", text: "在這之後建成的生活步入正常的軌道了。" },]
            },
            {
                text: "或許你可以開一個彙整串收錄冷門與過氣隊長試試？用你擅長的excel來實現。",
                score: 0,
                next: '神魔之塔2',
                reaction: [
                    { name: "建成", text: "建成扶了扶眼鏡說：聽起來是個有趣的提案，那麼我們來開始吧。" },
                    { name: "旁白", text: "就這樣，建成和你一起開始了這個大工程。" },
                ],
            },
            {
                text: "或許你可以挑戰成為神之手？我覺得你的實力十分甚至九分的強！",
                score: 20,
                next: '8', // 導向原場景 8
                reaction: [
                    { name: "建成", text: "真的嗎？那我就去挑戰了。這一冠，為了相信我的你。" },
                    { name: "旁白", text: "建成經過不懈的努力，成功登頂了神之手。在體驗到高處不勝寒的感覺後決定回到現實生活。" },
                ],
            }
        ]
    },
    {
        id: '神魔之塔2',
        steps: [
            { name: "旁白", text: "再過了一段時間，這項工程就逐漸壯大。" },
            { name: "旁白", text: "由於前來參與的人數眾多，開始變得越來越亂。" },
            { name: "旁白", text: "經過協商，你和建成一致決定要設下規矩，規范一下。" },
            { name: "旁白", text: "但是，規矩怎麼定呢？" },
            { name: "林建成", text: "你覺得我們該建立什麼規矩？" }
        ],
        options: [
            {
                text: "我都行，看你。",
                score: 0,
                next: '神魔之塔3',
                reaction: [
                    { name: "建成", text: "那得讓我好好想想了..." },
                    { name: "旁白", text: "就這樣，他開始搞了全自家，一大堆的隊長個別記錄，然後還讓玩家填卡片/時光牌編號。" },
                    { name: "旁白", text: "有時候讓他自己來辦，似乎是個不好的行為。" },
                ]
            },
            {
                text: "該禁掉的禁掉。",
                score: 0,
                next: '8', // 導向原場景 8
                reaction: [
                    { name: "建成", text: "確實，不能姑息他們。" },
                    { name: "旁白", text: "自從禁掉公車和解決黑科技的問題後，這個工程變得幹淨了。由於現實越來越忙，所以建成決定交給另一個人接手。" },
                ],
            },
            {
                text: "開讓自己輕鬆記錄的規定就行了。",
                score: 30,
                next: '8', // 導向原場景 8
                reaction: [
                    { name: "建成", text: "也是呢，我相信他們的自律。" },
                    { name: "旁白", text: "雖然變得輕鬆了，但總有幾個人都讓建成很困擾。" },
                    { name: "旁白", text: "但這不是還有你嘛，你親自下場和他們對線，讓建成專心於記錄。" },
                    { name: "建成", text: "「謝謝你幫我擋住了這些流言蜚語。」" },
                    {name: "旁白", text: "過了一段時間，由於現實忙碌，建成決定交接給其他人。" },
                ],
            }
        ]
    },
    {id: '神魔之塔3',
        steps: [
            { name: "旁白", text: "隨著卡片強度越來越高，獨立隊長也能當一回大王。" },
            { name: "旁白", text: "但建成似乎覺得這種不講道理的隊伍，是對雙隊長/單隊長規則的一種褻瀆。" },
            { name: "旁白", text: "他對此抱有疑問，所以找上了你。" },
            { name: "建成", text: "「你覺得我該不該拔掉獨立隊長的標籤?」" },
        ],
        options: [
            {
                text: "「我覺得不該，因為這也是他們的努力結晶。」",
                score: 0,
                next: '8', // 導向原場景 8
                reaction: [
                    { name: "建成", text: "「也是呢，我不該這樣鄙視他們的努力。」" },
                    { name: "旁白", text: "彙整串之後還是一如往常，不改變就是最大的改變。" },
                    { name: "旁白", text: "慢慢的，隨著自己的淡出，建成自己也淡忘了這件事情。" },
                ]
            },
            {
                text: "「該，神魔之塔就應該只有單隊長和雙隊長！」",
                score: 20,
                next: '神魔之塔4', // 導向原場景 8
                reaction: [
                    { name: "建成", text: "「【玩家名字】也是這樣覺得的嗎？我早有此意了。」" }, // 已替換: 你 -> 【玩家名字】
                    { name: "旁白", text: "隔天他就頒發了反獨立條款，雖然有些反對的聲音，但那畢竟是少數。" },
                    { name: "旁白", text: "建成自己覺得他的彙整串變得幹淨了，但他不知道的是，這讓本就壓抑的社群變得更嚴重了。" },
                ],
            }
        ]
    },
    {
        id: '神魔之塔4',
        steps: [
            { name: "旁白", text: "最近的關卡越來越多了。" },
            { name: "旁白", text: "建成的工程也隨著這樣的情況越來越多，但他似乎還樂在其中。" },
            { name: "旁白", text: "你也在社群聽見了對此抱怨的尖銳聲音。" },
            { name: "旁白", text: "你帶著這些反饋擺在建成的面前。" },
            { name: "林建成", text: "我覺得自己並沒有什麼影響，但你比較通人性，你怎麼看？" }
        ],
        options: [
            {
                text: "勸導建成少開工程。",
                score: 20,
                next: '8', // 導向原場景 8
                reaction: [
                    { name: "建成", text: "好吧，以後都只選高難關卡。" },
                    { name: "旁白", text: "工程減少了之後，玩家對建成的印象變得更好了。" },
                    { name: "旁白", text: "建成帶著這些榮譽功成身退，回到現實生活了。" },
                ]
            },
            {
                text: "讓他繼續跟著官方的步調。",
                score: 0,
                next: 'special_ending_check_塔批',
                reaction: [
                    { name: "建成", text: "嗯，每個關卡都是有自己的難點，不能依據草莓理論就做斷定。" },
                ],
            },
            {
                text: "要不我們就此收手吧。",
                score: 0,
                next: '8', // 導向原場景 8
                reaction: [
                    { name: "建成", text: "嗯，聽你的。" },
                    { name: "旁白", text: "在做完交接工作後，建成就回歸現實生活了。" },
                ],
            }
        ]
    },
]

exports.handler = async (event, context) => {
    return {
        statusCode: 200,
        headers: {
            'Content-Type': 'application/json',
            'Access-Control-Allow-Origin': '*' 
        },
        // 只回傳主線劇本
        body: JSON.stringify(script_tosLine), 
    };
}